base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/CommonModules/бит_ПраваДоступаОсновной/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыФункцииОпределенияНаличияДоступа

// Функция проверяет включен ли механизм разделения прав на уровне базы.
// 
// Возвращаемое значение:
//  флМеханизмОтключен - Булево.
// 
Функция МеханизмОтключен() Экспорт

	флМеханизмОтключен = ПолучитьФункциональнуюОпцию("бит_ИспользоватьРазделениеДоступаНаУровнеБазы") = Ложь 
	                     ИЛИ РольДоступна("бит_АдминистраторПравДоступа")
						 ИЛИ Пользователи.ЭтоПолноправныйПользователь(, Истина)
	                     ИЛИ бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(Пользователи.ТекущийПользователь()
	                              ,ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.ОтключитьМеханизмПравДоступаНаУровнеБазы);

	Возврат флМеханизмОтключен;
	
КонецФункции

// Процедура проверяет наличие прав доступа у данного пользователя на определенные действия над данным объектом
// перечень событий может быть передан в процедуру в виде структуры, либо может определяться автоматически, 
// в зависимости от вида и состояния объекта.
// 
// Параметры:
// ТекущийОбъект       - СправочникОбъект,ДокументОбъект.
// ТекущийПользователь - СправочникСсылка.Пользователи.
// РежимЗаписи         - РежимЗаписиДокумента.
// ТекущиеСобытия      - Структура - ключ: строка- имя события, значение: булево - доступность события.
// ДопПараметры        - Структура - Задел на будущее.
// 
Функция ПроверитьПраваДоступа(ТекущийОбъект, ТекущийПользователь, 
	РежимЗаписи = Неопределено, ТекущиеСобытия = Неопределено, ДопПараметры = Неопределено) Экспорт	
								  
	Если МеханизмОтключен() Тогда	
		Возврат Новый Структура;	
	КонецЕсли;
	
	// Определим имя объекта и вид объекта.
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	ИмяОбъекта        = МетаданныеОбъекта.Имя;
	ВидОбъекта        = бит_ПраваДоступа.ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);	
	ИмяОбъектаПолное  = бит_ПраваДоступа.ПолучитьПолноеИмяОбъекта(ИмяОбъекта, ВидОбъекта);
	
	ТекущийОбъектДоступа = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ИмяОбъектаПолное);
    
    // Если объект не нашли, то это скорее всего внешний отчет или внешняя обработка.
	Если НЕ ЗначениеЗаполнено(ТекущийОбъектДоступа) Тогда
    	Возврат Новый Структура;	
	КонецЕсли; 
    
    // Не проверяем права, если у объекта поднят флаг "Отключено".
	Если ТекущийОбъектДоступа.Отключено Тогда
    	Возврат Новый Структура;	
	КонецЕсли; 
	
	// Если пользователь администратор прав доступа, то доступ к справочнику пользователи безусловный.
	Если ТекущийОбъектДоступа.ИмяОбъектаПолное = "Справочник.Пользователи" Тогда	
	    Если РольДоступна("бит_АдминистраторПравДоступа") Тогда		 
            Возврат Новый Структура;		 
        КонецЕсли; 	
	КонецЕсли; 
	
	// Не проверяем права для определенного перечня имен.
	МассивИсключений = бит_ПраваДоступа.СформироватьМассивИменИсключений();
	Если МассивИсключений.Найти(ИмяОбъекта) <> Неопределено Тогда
    	Возврат Новый Структура;	
	КонецЕсли;
	
	// В режиме загрузки не проверяем права.
	Если НЕ (ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Отчет 
		     ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Обработка) 
			И ТекущийОбъект.ОбменДанными.Загрузка Тогда
	    Возврат Новый Структура;	
	КонецЕсли; 		

	// Определим текущее события.
	Если ТекущиеСобытия = Неопределено Тогда
	     События = ОпределитьТекущиеСобытия(ТекущийОбъект, МетаданныеОбъекта, ВидОбъекта, РежимЗаписи);
	Иначе	
	     События = ТекущиеСобытия;
	КонецЕсли; 
	
	// Получим права по текущему объекту и пользователю.
	СтруктураПрав = ПолучитьПраваДоступа(МетаданныеОбъекта, ТекущийПользователь,ТекущийОбъект);
	
	Для каждого КлючИЗначение Из События Цикл
		События[КлючИЗначение.Ключ] = СтруктураПрав[КлючИЗначение.Ключ];
	КонецЦикла; 
	События.Вставить("ОбластиДоступа", СтруктураПрав.ОбластиДоступа);
	
	Возврат События;
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура определяет перечень событий в зависимости от вида объекта и состояния объекта.
// 
// Параметры:
//  ТекущийОбъект     - СправочникСсылка, ДокументСсылка.
//  МетаданныеОбъекта - ОбъектМетаданных.
//  ВидОбъекта        - ПеречислениеСсылка.бит_ВидыОбъектовСистемы.
//  РежимЗаписи       - РежимЗаписиДокумента.
//                 
Функция ОпределитьТекущиеСобытия(ТекущийОбъект,МетаданныеОбъекта, ВидОбъекта, РежимЗаписи) 

	События = Новый Структура;
	
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Справочник ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Документ Тогда
        
        // Общие события для справочника и документа.
		События.Вставить("Редактирование",Ложь);
		Если ТекущийОбъект.ЭтоНовый() Тогда
			События.Вставить("Создание",Ложь);
		КонецЕсли; 
		Если НЕ ТекущийОбъект.ЭтоНовый() И ТекущийОбъект.ПометкаУдаления <> ТекущийОбъект.Ссылка.ПометкаУдаления Тогда
			События.Вставить("ПометкаНаУдаление",Ложь);
		КонецЕсли;
		
		// Специфические события справочника.
		Если ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Справочник И МетаданныеОбъекта.Иерархический Тогда
			Если ТекущийОбъект.Родитель <> ТекущийОбъект.Ссылка.Родитель Тогда
				События.Вставить("ПереносВГруппу",Ложь);
			КонецЕсли; 
		КонецЕсли; 
		
		// Специфические события документа.
		Если ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Документ Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				События.Вставить("Проведение",Ложь);
			КонецЕсли; 
			Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				События.Вставить("ОтменаПроведения",Ложь);
			КонецЕсли; 
        КонецЕсли; 
        
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Отчет Тогда
		События.Вставить("Редактирование",Ложь);
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Обработка Тогда
		События.Вставить("Редактирование",Ложь);
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрСведений Тогда
		События.Вставить("Редактирование",Ложь);
	КонецЕсли; 

    Возврат События;
    
КонецФункции

// Функция получает все права пользователя на данный объект.
// 
// Параметры:
// МетаданныеОбъекта   - ОбъектМетаданных.
// ТекущийПользователь - СправочникСсылка.Пользователи.
//                 
Функция ПолучитьПраваДоступа(МетаданныеОбъекта, ТекущийПользователь, ТекущийОбъект)

	РезСтруктура = Новый Структура;
	РезСтруктура.Вставить("Редактирование"   , Ложь);
	РезСтруктура.Вставить("Создание"         , Ложь);
	РезСтруктура.Вставить("Копирование"      , Ложь);
	РезСтруктура.Вставить("ПометкаНаУдаление", Ложь);
	РезСтруктура.Вставить("ПереносВГруппу"   , Ложь);
	РезСтруктура.Вставить("Проведение"       , Ложь);
	РезСтруктура.Вставить("ОтменаПроведения" , Ложь);
	РезСтруктура.Вставить("Печать"           , Ложь);
	РезСтруктура.Вставить("ОбластиДоступа"   , Новый Массив);
									   
	ИмяОбъекта = МетаданныеОбъекта.Имя;
	ВидОбъекта = бит_ПраваДоступа.ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);
	ИмяОбъектаПолное = бит_ПраваДоступа.ПолучитьПолноеИмяОбъекта(ИмяОбъекта,ВидОбъекта);
	
	// Получим области доступа для текущего объекта.
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Справочник ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Документ Тогда
		МассивОбластейДоступа = ОбластиДоступаОбъекта(ТекущийОбъект, МетаданныеОбъекта, ИмяОбъектаПолное);
	Иначе	
		МассивОбластейДоступа = Новый Массив;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СубъектДоступа"       , ТекущийПользователь);
	Запрос.УстановитьПараметр("ИмяОбъектаПолное"     , ИмяОбъектаПолное);
	Запрос.УстановитьПараметр("ВидОбъекта"           , ВидОбъекта);
	Запрос.УстановитьПараметр("МассивОбластейДоступа", МассивОбластейДоступа);	
	
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыПользователейСостав.Ссылка КАК СубъектДоступа
	|ПОМЕСТИТЬ СубъектыДоступа
	|ИЗ
	|	Справочник.ГруппыПользователей.%ИмяТабЧасти% КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &СубъектДоступа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&СубъектДоступа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ОбъектыСистемы.Ссылка
	|ПОМЕСТИТЬ ОбъектыДоступа
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	бит_ОбъектыСистемы.ИмяОбъектаПолное = &ИмяОбъектаПолное
	|	И НЕ бит_ОбъектыСистемы.Отключено
	|	И бит_ОбъектыСистемы.ВидОбъекта = &ВидОбъекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПраваДоступа.ОбъектДоступа КАК ОбъектДоступа,
	|	МАКСИМУМ(бит_ПраваДоступа.Редактирование) КАК Редактирование,
	|	МАКСИМУМ(бит_ПраваДоступа.Создание) КАК Создание,
	|	МАКСИМУМ(бит_ПраваДоступа.Копирование) КАК Копирование,
	|	МАКСИМУМ(бит_ПраваДоступа.ПометкаНаУдаление) КАК ПометкаНаУдаление,
	|	МАКСИМУМ(бит_ПраваДоступа.ПереносВГруппу) КАК ПереносВГруппу,
	|	МАКСИМУМ(бит_ПраваДоступа.Проведение) КАК Проведение,
	|	МАКСИМУМ(бит_ПраваДоступа.ОтменаПроведения) КАК ОтменаПроведения,
	|	МАКСИМУМ(бит_ПраваДоступа.Печать) КАК Печать
	|ИЗ
	|	РегистрСведений.бит_ПраваДоступа КАК бит_ПраваДоступа
	|ГДЕ
	|	бит_ПраваДоступа.СубъектДоступа В
	|			(ВЫБРАТЬ
	|				СубъектыДоступа.СубъектДоступа
	|			ИЗ
	|				СубъектыДоступа КАК СубъектыДоступа)
	|	И бит_ПраваДоступа.ОбъектДоступа В
	|			(ВЫБРАТЬ
	|				ОбъектыДоступа.Ссылка
	|			ИЗ
	|				ОбъектыДоступа КАК ОбъектыДоступа)
	|	И бит_ПраваДоступа.ВидОбъекта = &ВидОбъекта
	|    %УсловиеОбластиДоступа%					
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПраваДоступа.ОбъектДоступа";
	
	
	Если МассивОбластейДоступа.Количество() = 0 Тогда		
		ТекстУсловиеОбластьДоступа = "И бит_ПраваДоступа.ОбластьДоступа = ЗНАЧЕНИЕ(Справочник.бит_ОбластиДоступа.ПустаяСсылка)";		
	Иначе			
		ТекстУсловиеОбластьДоступа = "И бит_ПраваДоступа.ОбластьДоступа В(&МассивОбластейДоступа) И НЕ бит_ПраваДоступа.ОбластьДоступа.Отключено";		
	КонецЕсли; 					   
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеОбластиДоступа%", ТекстУсловиеОбластьДоступа);  
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяТабЧасти%",бит_ОбщегоНазначения.ИмяТабЧастиГруппыПользователей()); 
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();	
	Если Выборка.Следующий() Тогда
		
		Для каждого КлючИЗначение Из РезСтруктура Цикл
			Если КлючИЗначение.Ключ = "ОбластиДоступа" Тогда
				Продолжить;
			КонецЕсли; 			
			РезСтруктура[КлючИЗначение.Ключ] = Выборка[КлючИЗначение.Ключ];
		КонецЦикла; 
		
    КонецЕсли; 
    
	РезСтруктура.ОбластиДоступа = МассивОбластейДоступа;
	
	Возврат РезСтруктура;	

КонецФункции

// Получает массив областей доступа, которым принадлежит текущий объект.
// 
// Параметры:
//  ТекущийОбъект      - ДокументОбъект, СправочникОбъект.
//  МетаданныеОбъекта  - ОбъектМетаданных.
//  ИмяОбъектаПолное   - Строка.
// 
// Возвращаемое значение:
//   Массив. 
// 
Функция ОбластиДоступаОбъекта(ТекущийОбъект, МетаданныеОбъекта, ИмяОбъектаПолное)

	МассивОбластейДоступа = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ОбластиДоступа.Ссылка КАК ОбластьДоступа
	|ИЗ
	|	Справочник.бит_ОбластиДоступа КАК бит_ОбластиДоступа
	|ГДЕ
	|	(НЕ бит_ОбластиДоступа.ПометкаУдаления)
	|	И бит_ОбластиДоступа.Владелец В
	|			(ВЫБРАТЬ
	|				бит_ОбъектыСистемы.Ссылка
	|			ИЗ
	|				Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|			ГДЕ
	|				бит_ОбъектыСистемы.ИмяОбъектаПолное = &ИмяОбъектаПолное
	|                И НЕ бит_ОбъектыСистемы.Отключено)
	|	И НЕ бит_ОбластиДоступа.Отключено";
				   
	Запрос.УстановитьПараметр("ИмяОбъектаПолное", ИмяОбъектаПолное);
	
	Результат = Запрос.Выполнить();	
	Если НЕ Результат.Пустой() Тогда
		ТабРеквизитов = бит_ПраваДоступа.СформироватьТаблицуРеквизитовОбъекта(ТекущийОбъект,МетаданныеОбъекта);
	КонецЕсли; 	
	
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
	
		ОбластьДоступа = Выборка.ОбластьДоступа;
		СохраненнаяНастройка = ОбластьДоступа.НастройкиПостроителя.Получить();
		Если ТипЗнч(СохраненнаяНастройка) = Тип("Структура") И СохраненнаяНастройка.Свойство("Отбор") Тогда
		
			ПостроительЗапроса = Новый ПостроительЗапроса;
			ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабРеквизитов);
			
			Для каждого ЭлементОтбора Из СохраненнаяНастройка.Отбор Цикл
				Попытка
					ОписаниеЭлемента = ЭлементОтбора.ПутьКДанным;
					НовыйЭлОтбора    = ПостроительЗапроса.Отбор.Добавить(ОписаниеЭлемента);
					бит_ОбщегоНазначения.ЗаполнитьЭлементОтбора(ЭлементОтбора, НовыйЭлОтбора);
				Исключение
					ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
			КонецЦикла; 
            
            ПостроительЗапроса.Выполнить();            
            Если Не ПостроительЗапроса.Результат.Пустой() Тогда			
				МассивОбластейДоступа.Добавить(Выборка.ОбластьДоступа);			
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЦикла; 
	
  Возврат МассивОбластейДоступа;
  
КонецФункции

#КонецОбласти
